marketplace/app/views/users/_user.html.erb

    <div>
        <%= user.likes.count %> Likes
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]