marketplace/app/views/devise/registrations/new.html.erb

  <%= f.label :tax_rate_by_location, "Province" %>
  <%= f.collection_select :tax_rate_by_location, TaxRateByLocation.all, :id, :province, include_blank: true %>
---
SELECT "tax_rate_by_locations".* FROM "tax_rate_by_locations" ORDER BY "tax_rate_by_locations"."province" ASC