marketplace/app/views/application/_header.html.erb

                      <%= f.label :service_type_id_eq, "Service Type" %>
                      <%= f.collection_select :service_type_id_eq, ServiceType.all, :id, :service_type_name, include_blank: true %>
---
SELECT "service_types".* FROM "service_types"