marketplace/app/controllers/application_controller.rb

INSERT INTO "carts" ("total", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["total", 0], ["user_id", 1], ["created_at", "2024-07-16 00:31:30.550980"], ["updated_at", "2024-07-16 00:31:30.550980"]]
---
  def check_cart
    return unless user_signed_in?
    return if current_user.cart

    Cart.create!(
      user_id: current_user.id,
      total:   0
    )