marketplace/app/controllers/pages_controller.rb

  def index
    @service_types = ServiceType.all
---
SELECT "service_types".* FROM "service_types"

  def about
    @service_types = ServiceType.all
---
SELECT "service_types".* FROM "service_types"