marketplace/app/controllers/service_offers_controller.rb

SELECT "service_offers".* FROM "service_offers" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(DISTINCT "service_offers"."id") FROM "service_offers"
SELECT "service_types".* FROM "service_types"
---
  def index
    # @service_offers = ServiceOffer.order(:service_type_id).page(params[:page]).per(4)

    @q = ServiceOffer.ransack(params[:q])
    @service_offers = @q.result(distinct: true).page(params[:page]).per(4)

    @service_types = ServiceType.all

SELECT "service_offers".* FROM "service_offers" WHERE "service_offers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "service_types".* FROM "service_types"
---
  def show
    @service_offer = ServiceOffer.find(params[:id])
    @service_types = ServiceType.all