marketplace/app/controllers/service_types_controller.rb

SELECT "service_types".* FROM "service_types" WHERE "service_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "service_types".* FROM "service_types"
---
  def show
    @service_type = ServiceType.find(params[:id])
    @service_types = ServiceType.all