marketplace/app/controllers/service_offers_controller.rb

  def index
    @service_offers = ServiceOffer.order(:service_type_id).page(params[:page]).per(3)
---
SELECT "service_offers".* FROM "service_offers" ORDER BY "service_offers"."service_type_id" ASC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]