marketplace/app/controllers/users_controller.rb

  def index
    # @users = User.order(:user_name).page(params[:page]).per(6)

    @q = User.order(:user_name).ransack(params[:q])
    @users = @q.result.page(params[:page]).per(3)

    @service_types = ServiceType.all
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
SELECT "service_types".* FROM "service_types"

  def show
    @user = User.find(params[:id])
    @service_types = ServiceType.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "service_types".* FROM "service_types"