marketplace/app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
---
  def index
    # @users = User.order(:user_name).page(params[:page]).per(6)

    @q = User.ransack(params[:q])
    @users = @q.result.page(params[:page]).per(6)